In [ ]:
import pandas as pd
import sqlite3
from sqlalchemy import create_engine

In [ ]:
# Connect to database  using sqlite3
connection = sqlite3.connect('bankloan.db')

In [ ]:

# Creating table query
sql_query = """
CREATE TABLE client_loan (
    account_id       INTEGER,
    district_id      INTEGER,
    statement_freq   VARCHAR(50),
    client_id        INTEGER,
    gender           VARCHAR(10),
    DateOfBirth      DATE,
    loan_id          VARCHAR(50),
    loan_date        DATE,
    amount           REAL,
    duration         INTEGER,
    payments         REAL,
    contract_status  VARCHAR(20),
    isdebt          VARCHAR(10),
    dis_name        VARCHAR(50),
    Region          VARCHAR(50),
    Avg_Salary      REAL,
    UnempRate95     REAL,
    UnempRate96     REAL
);
"""
# Creating cursor object using connection obj
cursor = connection.cursor()
	
#sql query to get all the tables
sql_query = """SELECT * FROM bankloan  
  WHERE type='table';"""
  
# executing our sql query
cursor.execute(sql_query)
print("List of tables\n")

# printing all tables list
print(cursor.fetchall())

List of tables

[('client_loan',)]

In [ ]:
# Read CSV into pandas DataFrame  
df = pd.read_csv('data/bank_loan.csv')   

# Write DataFrame to SQL table (replace 'your_table_name' with your table)  
df.to_sql('client_loan', connection, if_exists='replace', index=False)  


#executing sql query to fetch the data from the table
cursor.execute("SELECT * FROM client_loan limit 10")
rows = cursor.fetchall()

# Print the retrieved data
for row in rows:
    print(row)


# Commit and close
connection.commit()
connection.close()

(5270, 44, 'Monthly', 100, 'Female', '1942-08-11', 6077, '1993-11-22', 79608, 24, 3317, 'Contract Closed', 'No', 'Chrudim', 'east Bohemia', 8254, 2.79, 3.76)
(5270, 44, 'Monthly', 124, 'Male', '1967-09-21', 6077, '1993-11-22', 79608, 24, 3317, 'Contract Closed', 'No', 'Chrudim', 'east Bohemia', 8254, 2.79, 3.76)
(5270, 44, 'Monthly', 235, 'Female', '1943-08-28', 6077, '1993-11-22', 79608, 24, 3317, 'Contract Closed', 'No', 'Chrudim', 'east Bohemia', 8254, 2.79, 3.76)
(5270, 44, 'Monthly', 343, 'Male', '1919-11-19', 6077, '1993-11-22', 79608, 24, 3317, 'Contract Closed', 'No', 'Chrudim', 'east Bohemia', 8254, 2.79, 3.76)
(5270, 44, 'Monthly', 471, 'Male', '1977-01-11', 6077, '1993-11-22', 79608, 24, 3317, 'Contract Closed', 'No', 'Chrudim', 'east Bohemia', 8254, 2.79, 3.76)
(5270, 44, 'Monthly', 590, 'Male', '1949-02-15', 6077, '1993-11-22', 79608, 24, 3317, 'Contract Closed', 'No', 'Chrudim', 'east Bohemia', 8254, 2.79, 3.76)
(5270, 44, 'Monthly', 993, 'Female', '1969-10-31', 6077, '1993-11-22', 79608, 24, 3317, 'Contract Closed', 'No', 'Chrudim', 'east Bohemia', 8254, 2.79, 3.76)
(5270, 44, 'Monthly', 1001, 'Male', '1947-04-14', 6077, '1993-11-22', 79608, 24, 3317, 'Contract Closed', 'No', 'Chrudim', 'east Bohemia', 8254, 2.79, 3.76)
(5270, 44, 'Monthly', 1274, 'Male', '1976-01-25', 6077, '1993-11-22', 79608, 24, 3317, 'Contract Closed', 'No', 'Chrudim', 'east Bohemia', 8254, 2.79, 3.76)
(5270, 44, 'Monthly', 1380, 'Female', '1953-07-29', 6077, '1993-11-22', 79608, 24, 3317, 'Contract Closed', 'No', 'Chrudim', 'east Bohemia', 8254, 2.79, 3.76)